Дипломная_работа/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дипломная_работа/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Дипломная_работа/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Дипломная_работа/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дипломная_работа/src/Documents/РеализацияТоваровУслуг/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;  
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;    
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;   
	
	// ВКМ добавляем изменение в запись регистра Продажи и Взаиморасчетов с покупателями при изменении суммы реализации
	НаборЗаписей = РегистрыНакопления.ЗадолженностьПокупателей.СоздатьНаборЗаписей();  
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка.Основание);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись из НаборЗаписей Цикл
		Запись.Сумма = СуммаДокумента;
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
	
	Набор = РегистрыНакопления.Продажи.СоздатьНаборЗаписей();  
	Набор.Отбор.Регистратор.Установить(Ссылка.Основание);
	Набор.Прочитать(); 
	Набор.Очистить();
	Для Каждого ТекСтрокаУслуги из Услуги Цикл
		Движение = Набор.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;  
		Движение.Договор = Договор;
		Движение.Номенклатура = ТекСтрокаУслуги.Номенклатура;
		Движение.Сумма = ТекСтрокаУслуги.Сумма;
	КонецЦикла;
	
	Набор.Записать(); 
	
	// ВКМ добавляем изменение в запись регистра Продажи и Взаиморасчетов с покупателями при изменении суммы реализации
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

//ВКМ Добавлена функция автоматического заполнения суммой абоненской платы и выполеннных работ
Процедура ВыполнитьАвтозаполнение(ДокОбъект)Экспорт 
	
	АбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	ВыполненныеРаботы = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	
	Если НЕ ЗначениеЗаполнено(АбонентскаяПлата)Тогда
		 Сообщение = Новый СообщениеПользователю;
		 Сообщение.Текст = "Необходимо заполнить значение константы Номенклатура абонентской платы";
		 Сообщение.Сообщить(); 
		 Возврат;
	КонецЕсли;	 
	Если НЕ ЗначениеЗаполнено(ВыполненныеРаботы)Тогда
		 Сообщение = Новый СообщениеПользователю;
		 Сообщение.Текст = "Необходимо заполнить значение константы Номенклатура работы специалиста";
		 Сообщение.Сообщить(); 
		 Возврат;
	КонецЕсли;	  
	
	ДокОбъект.Товары.Очистить();
	ДокОбъект.Услуги.Очистить();
	ДокОбъект.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслуг.Договор.Ссылка КАК ДоговорСсылка,
		|	РеализацияТоваровУслуг.Договор.ВКМ_СуммаЕжемесячнойПлаты КАК СуммаЕжемесячнойПлаты,
		|	РеализацияТоваровУслуг.Договор.ВКМ_СтоимостьЧаса КАК СтоимостьЧаса,
		|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот, 0) КАК КоличествоЧасов,
		|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот, 0) КАК СуммаКОплате
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&ДатаНачала, &ДатаОкончания, , Договор = &Договор) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты
		|		ПО РеализацияТоваровУслуг.Договор = ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &Ссылка";     
	
	Запрос.УстановитьПараметр("Ссылка", ДокОбъект.Ссылка);  
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ДокОбъект.Ссылка.Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ДокОбъект.Ссылка.Дата));
	Запрос.УстановитьПараметр("Договор", ДокОбъект.Ссылка.Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();  
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.СуммаЕжемесячнойПлаты > 0 Тогда
			
			НоваяСтрока = ДокОбъект.Услуги.Добавить();    
			НоваяСтрока.Номенклатура = АбонентскаяПлата;
			НоваяСтрока.Количество = 1;
			НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.СуммаЕжемесячнойПлаты;    
			НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.СуммаЕжемесячнойПлаты; 
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЕсли; 
		
		Если ВыборкаДетальныеЗаписи.СуммаКОплате > 0 Тогда
			
			НоваяСтрока = ДокОбъект.Услуги.Добавить();    
			НоваяСтрока.Номенклатура = ВыполненныеРаботы;
			НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.КоличествоЧасов;
			НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.СуммаКОплате / ВыборкаДетальныеЗаписи.КоличествоЧасов;   
			НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.СуммаКОплате; 
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);  
			
		КонецЕсли;
		
	КонецЦикла;   
	
КонецПроцедуры	   
//ВКМ Добавлена функция автоматического заполнения суммой абоненской платы и выполеннных работ

 #КонецОбласти

#КонецЕсли
